{"id":83023,"xmlId":"com.nnthink.aixcoder","name":"AiXcoder Code Completer","description":"\n        <h1>AiXcoder Code Completer &amp; Code Search Engine</h1>\n        <p>AiXcoder is a powerful code completer &amp; code serach engine based on state-of-the-art deep learning technology. It has the potential of recommending you a full line of code, which will help you code faster. AiXcoder also provides a code search engine to help you search for API use cases on GitHub.</p>\n        <br>\n        <img src=\"https://image.aixcoder.com/images/java_demo_0326.gif\" alt=\"Java completion\">\n        <h2>Requirements</h2>\n        <ul>\n            <li>IntelliJ/WebStorm 2017.2+</li>\n            <li>JRE 1.8+</li>\n            <li>Around 500 MB of free memory.</li>\n            <li>More than 300 MB of free disk space in your home directory.</li>\n        </ul>\n        <h2>Features</h2>\n        <ul>\n            <li>Java/JavaScript/TypeScript is supported now. More languages supports (Python/C++/PHP/Go) are on the way...</li>\n            <li>Completely works offline. Your code is safe in your hand.</li>\n            <li>Long completion result with length up to a full line.</li>\n            <li>Rearrange completion items in a likelyhood probability descending order.</li>\n        </ul>\n        <h2>Troubleshooting</h2>\n        <ul>\n            <li>AiXcoder code completer will be launched automatically when you begin to type code.</li>\n            <li>When you start using aiXcoder on a new project, an indexing process is required for aiXcoder to parse your code. AiXcoder will provide more accurate completions after that.</li>\n            <li>\n                The service is running as several processes, including \"aix-node(.exe)\". You can safely kill the process(es) at any time. The executables are located in /aiXcoder/installer/localserver/current/server/. Removing the folder and then restart IDE will force this plugin to re-download the service.\n            </li>\n        </ul>\n    ","tags":["Code tools"],"vendor":"aiXcoder","version":"1.0.2","notes":"\n        <ul>\n            <li>1.0.2\n                <ul>\n                    <li>Formal release of aiXcoder.</li>\n                </ul>\n            </li>\n        </ul>\n    ","dependencies":["com.intellij.modules.lang"],"since":"172.0"}